{
  "char_to_idx": {
    "\n": 0,
    " ": 1,
    "!": 2,
    "'": 3,
    ",": 4,
    "-": 5,
    ".": 6,
    "<": 7,
    ">": 8,
    "A": 9,
    "B": 10,
    "C": 11,
    "D": 12,
    "E": 13,
    "F": 14,
    "G": 15,
    "H": 16,
    "I": 17,
    "J": 18,
    "K": 19,
    "L": 20,
    "M": 21,
    "N": 22,
    "O": 23,
    "P": 24,
    "R": 25,
    "S": 26,
    "T": 27,
    "U": 28,
    "V": 29,
    "W": 30,
    "Y": 31,
    "a": 32,
    "b": 33,
    "c": 34,
    "d": 35,
    "e": 36,
    "f": 37,
    "g": 38,
    "h": 39,
    "i": 40,
    "j": 41,
    "k": 42,
    "l": 43,
    "m": 44,
    "n": 45,
    "o": 46,
    "p": 47,
    "q": 48,
    "r": 49,
    "s": 50,
    "t": 51,
    "u": 52,
    "v": 53,
    "w": 54,
    "x": 55,
    "y": 56,
    "z": 57,
    "—": 58,
    "☕": 59,
    "⚡": 60,
    "✈": 61,
    "✨": 62,
    "️": 63,
    "🌅": 64,
    "🌇": 65,
    "🌊": 66,
    "🌍": 67,
    "🌟": 68,
    "🌮": 69,
    "🌴": 70,
    "🍓": 71,
    "🍕": 72,
    "🍜": 73,
    "🍝": 74,
    "🍣": 75,
    "🎀": 76,
    "🎯": 77,
    "🏃": 78,
    "🏆": 79,
    "🏋": 80,
    "🏔": 81,
    "🏖": 82,
    "🏗": 83,
    "🏙": 84,
    "🏛": 85,
    "🏠": 86,
    "🏡": 87,
    "👗": 88,
    "👜": 89,
    "👠": 90,
    "💅": 91,
    "💎": 92,
    "💥": 93,
    "💪": 94,
    "💰": 95,
    "🔑": 96,
    "🔥": 97,
    "🕶": 98,
    "🖤": 99,
    "🗺": 100,
    "🛋": 101,
    "🥑": 102,
    "🥗": 103,
    "🧁": 104,
    "🧘": 105,
    "🧳": 106,
    "🪴": 107
  },
  "idx_to_char": {
    "0": "\n",
    "1": " ",
    "2": "!",
    "3": "'",
    "4": ",",
    "5": "-",
    "6": ".",
    "7": "<",
    "8": ">",
    "9": "A",
    "10": "B",
    "11": "C",
    "12": "D",
    "13": "E",
    "14": "F",
    "15": "G",
    "16": "H",
    "17": "I",
    "18": "J",
    "19": "K",
    "20": "L",
    "21": "M",
    "22": "N",
    "23": "O",
    "24": "P",
    "25": "R",
    "26": "S",
    "27": "T",
    "28": "U",
    "29": "V",
    "30": "W",
    "31": "Y",
    "32": "a",
    "33": "b",
    "34": "c",
    "35": "d",
    "36": "e",
    "37": "f",
    "38": "g",
    "39": "h",
    "40": "i",
    "41": "j",
    "42": "k",
    "43": "l",
    "44": "m",
    "45": "n",
    "46": "o",
    "47": "p",
    "48": "q",
    "49": "r",
    "50": "s",
    "51": "t",
    "52": "u",
    "53": "v",
    "54": "w",
    "55": "x",
    "56": "y",
    "57": "z",
    "58": "—",
    "59": "☕",
    "60": "⚡",
    "61": "✈",
    "62": "✨",
    "63": "️",
    "64": "🌅",
    "65": "🌇",
    "66": "🌊",
    "67": "🌍",
    "68": "🌟",
    "69": "🌮",
    "70": "🌴",
    "71": "🍓",
    "72": "🍕",
    "73": "🍜",
    "74": "🍝",
    "75": "🍣",
    "76": "🎀",
    "77": "🎯",
    "78": "🏃",
    "79": "🏆",
    "80": "🏋",
    "81": "🏔",
    "82": "🏖",
    "83": "🏗",
    "84": "🏙",
    "85": "🏛",
    "86": "🏠",
    "87": "🏡",
    "88": "👗",
    "89": "👜",
    "90": "👠",
    "91": "💅",
    "92": "💎",
    "93": "💥",
    "94": "💪",
    "95": "💰",
    "96": "🔑",
    "97": "🔥",
    "98": "🕶",
    "99": "🖤",
    "100": "🗺",
    "101": "🛋",
    "102": "🥑",
    "103": "🥗",
    "104": "🧁",
    "105": "🧘",
    "106": "🧳",
    "107": "🪴"
  }
}